In [1]:
import pandas as pd

###   Creation of Dataframes in pandas

In [3]:
data = {"Name" : ["Chetan","Aakash","Shivam"],
       "Age": [21,20,23],
       "Salary": [50000,45000,60000]
       }
dict = pd.DataFrame(data)
print(dict)

     Name  Age  Salary
0  Chetan   21   50000
1  Aakash   20   45000
2  Shivam   23   60000

In [4]:
data = [23,46,56,76]
print(pd.Series(data))

0    23
1    46
2    56
3    76
dtype: int64

In [5]:
data = pd.read_csv("D:/Data Science Doument  ExcelR/Data Sets/customer_data.csv")
print(data.head())

   Customer_ID   Name   Age       City  Purchase_Amount
0          101   Amit  25.0     Mumbai           5000.0
1          102   Riya  30.0      Delhi           7000.0
2          103  Sohan   NaN  Bangalore           4500.0
3          104  Priya  28.0    Chennai              NaN
4          105    NaN  40.0    Kolkata           8000.0

In [6]:
data1 = pd.read_excel("D:/Data Science Doument  ExcelR/Data Sets/Universities.xlsx")
print(data1.head())

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0     Brown  1310     89      22       13     22704        94
1   CalTech  1415    100      25        6     63575        81
2       CMU  1260     62      59        9     25026        72
3  Columbia  1310     76      24       12     31510        88
4   Cornell  1280     83      33       13     21864        90

### Exploring Data in pandas

In [9]:
print(data1.tail(10))

          Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
15      Purdue  1005     28      90       19      9066        69
16    Stanford  1360     90      20       12     36450        93
17    TexasA&M  1075     49      67       25      8704        67
18  UCBerkeley  1240     95      40       17     15140        78
19    UChicago  1290     75      50       13     38380        87
20   UMichigan  1180     65      68       16     15470        85
21       UPenn  1285     80      36       11     27553        90
22         UVA  1225     77      44       14     13349        92
23  UWisconsin  1085     40      69       15     11857        71
24        Yale  1375     95      19       11     43514        96

In [12]:
print(data.head(10))

   Customer_ID   Name   Age       City  Purchase_Amount
0          101   Amit  25.0     Mumbai           5000.0
1          102   Riya  30.0      Delhi           7000.0
2          103  Sohan   NaN  Bangalore           4500.0
3          104  Priya  28.0    Chennai              NaN
4          105    NaN  40.0    Kolkata           8000.0
5          106   Neha  22.0        NaN           3000.0
6          106   Neha  22.0     Mumbai           3000.0

In [14]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Univ      25 non-null     object
 1   SAT       25 non-null     int64
 2   Top10     25 non-null     int64
 3   Accept    25 non-null     int64
 4   SFRatio   25 non-null     int64
 5   Expenses  25 non-null     int64
 6   GradRate  25 non-null     int64
dtypes: int64(6), object(1)
memory usage: 1.5+ KB

In [15]:
data1.describe()

               SAT       Top10     Accept   SFRatio      Expenses   GradRate
count    25.000000   25.000000  25.000000  25.00000     25.000000  25.000000
mean   1266.440000   76.480000  39.200000  12.72000  27388.000000  86.720000
std     108.359771   19.433905  19.727308   4.06735  14424.883165   9.057778
min    1005.000000   28.000000  14.000000   6.00000   8704.000000  67.000000
25%    1240.000000   74.000000  24.000000  11.00000  15140.000000  81.000000
50%    1285.000000   81.000000  36.000000  12.00000  27553.000000  90.000000
75%    1340.000000   90.000000  50.000000  14.00000  34870.000000  94.000000
max    1415.000000  100.000000  90.000000  25.00000  63575.000000  97.000000

In [16]:
data1.isnull().sum()

Univ        0
SAT         0
Top10       0
Accept      0
SFRatio     0
Expenses    0
GradRate    0
dtype: int64

In [17]:
data1.dtypes

Univ        object
SAT          int64
Top10        int64
Accept       int64
SFRatio      int64
Expenses     int64
GradRate     int64
dtype: object

### Handlinng Duplicated value

In [35]:
df = pd.read_excel("D:/Data Science Doument  ExcelR/Data Sets/company.xlsx")
print(df)

    EEID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

In [37]:
print(df["EEID"].duplicated().sum())

1

In [39]:
print(df.drop_duplicates("EEID"))

    EEID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

## working with Missing Data in pandas

In [54]:
data = pd.read_excel("D:/Data Science Doument  ExcelR/Data Sets/company.xlsx")
print(data)

    EEID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

In [56]:
print(data.isnull().sum())

EEID      0
Name      1
Gender    1
Salary    1
dtype: int64

In [60]:
print(data.dropna())

    EEID    Name Gender   Salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  27000.0
5  EMP06   rohit      M  25000.0

In [62]:
print(data)

    EEID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

In [66]:
import numpy as np
print(data.replace(np.nan,'hi'))

    EEID     Name Gender   Salary
0  EMP01   ayushi      F       hi
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli     hi  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05       hi      M  20000.0
5  EMP06    rohit      M  25000.0

In [80]:
data["Salary"] = data["Salary"].replace(np.nan,24800.0)
print(data)

    EEID     Name Gender   Salary
0  EMP01   ayushi      F  24800.0
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

In [74]:
print(data)

    EEID     Name Gender   Salary
0  EMP01   ayushi      F  30000.0
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

In [86]:
data = pd.read_excel("D:/Data Science Doument  ExcelR/Data Sets/company.xlsx")
print(data)

    EEID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

In [78]:
print(data['Salary'].mean())

24800.0

In [82]:
data["Salary"] = data["Salary"].replace(np.nan,24800.0)
print(data)

    EEID     Name Gender   Salary
0  EMP01   ayushi      F  24800.0
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    NaN  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      NaN      M  20000.0
5  EMP06    rohit      M  25000.0

In [84]:
print(data['Salary'].mean())

24800.0

In [90]:
print(data.fillna(method = "bfill"))

    EEID     Name Gender   Salary
0  EMP01   ayushi      F  25000.0
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli      F  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05    rohit      M  20000.0
5  EMP06    rohit      M  25000.0

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15416\2754045057.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "bfill"))

In [92]:
print(data.fillna(method = "ffill"))

    EEID     Name Gender   Salary
0  EMP01   ayushi      F      NaN
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli      M  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05   ayushi      M  20000.0
5  EMP06    rohit      M  25000.0

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15416\1391920301.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "ffill"))

In [96]:
print(data.fillna("hii"))

    EEID     Name Gender   Salary
0  EMP01   ayushi      F      hii
1  EMP02    rohit      M  25000.0
2  EMP03  pranjli    hii  27000.0
3  EMP01   ayushi      F  27000.0
4  EMP05      hii      M  20000.0
5  EMP06    rohit      M  25000.0

### columns transforation in pandas part 1

In [107]:
data1= pd.read_excel("C:/Users/Lenovo/OneDrive/Desktop/python data analytics/sample_data.xlsx")
print(data1)

                       Country  Year   Rank  Total  S1: Demographic Pressures  \
0                      Somalia  2023    1st  111.9                       10.0
1                        Yemen  2023    2nd  108.9                        9.6
2                  South Sudan  2023    3rd  108.5                        9.7
3    Congo Democratic Republic  2023    4th  107.2                        9.7
4                        Syria  2023    5th  107.1                        7.4
..                         ...   ...    ...    ...                        ...
174                Switzerland  2023  175th   17.8                        2.4
175                New Zealand  2023  176th   16.7                        1.1
176                    Finland  2023  177th   16.0                        1.7
177                    Iceland  2023  178th   15.7                        1.5
178                     Norway  2023  179th   14.5                        1.4

     S2: Refugees and IDPs  C3: Group Grievance  \
0                      9.0                  8.7
1                      9.6                  8.8
2                     10.0                  8.6
3                      9.8                  9.4
4                      9.1                  9.1
..                     ...                  ...
174                    3.2                  2.1
175                    1.2                  2.0
176                    1.9                  0.3
177                    1.5                  0.5
178                    1.7                  3.1

     E3: Human Flight and Brain Drain  E2: Economic Inequality  E1: Economy  \
0                                 8.6                      9.1          9.5
1                                 6.4                      7.9          9.9
2                                 6.5                      8.6          8.6
3                                 6.4                      8.4          8.1
4                                 8.0                      6.5          9.6
..                                ...                      ...          ...
174                               1.0                      2.4          1.6
175                               1.6                      2.6          2.6
176                               1.5                      1.6          2.7
177                               1.6                      1.5          2.6
178                               0.7                      1.4          1.4

     P1: State Legitimacy  P2: Public Services  P3: Human Rights  \
0                     9.6                  9.8               9.0
1                     9.8                  9.6               9.6
2                     9.8                  9.7               8.7
3                     9.3                  9.3               9.3
4                    10.0                  9.0               9.1
..                    ...                  ...               ...
174                   0.3                  1.6               0.4
175                   0.5                  1.1               0.5
176                   0.4                  1.0               0.5
177                   0.4                  0.9               0.4
178                   0.4                  1.0               0.4

     C1: Security Apparatus  C2: Factionalized Elites  \
0                       9.5                      10.0
1                       8.6                       9.9
2                       9.9                       9.2
3                       8.8                       9.6
4                       9.4                       9.9
..                      ...                       ...
174                     1.4                       1.0
175                     1.6                       1.4
176                     2.0                       1.4
177                     0.4                       1.8
178                     1.4                       1.1

     X1: External Intervention
0                          9.1
1                          9.2
2                          9.2
3                          9.1
4                         10.0
..                         ...
174                        0.4
175                        0.5
176                        1.0
177                        2.6
178                        0.5

[179 rows x 16 columns]

In [115]:
df = pd.read_csv("C:/Users/Lenovo/OneDrive/Desktop/python data analytics/customer.csv")
print(df)
print()

    EEID     Name    Age  Salary Gender
0  EMP01   Chetan     21   20000      M
1  EMP02   Aakash     20   23000      M
2  EMP03  Darshan     23   20000    NaN
3  EMP01   Lokesh     25   15000      M
4  EMP05     Yash     24   20000    NaN
5  EMP06   Sakshi     18   50000      F
6  EMP07   Chetan     21   20000      M
7  EMP08   Aakash     21   25000    NaN
8  EMP09   Lokesh     25    5000      M

In [123]:
df.loc[(df["Salary"] < 20000),"Salary GorB"] = "Good Salary Pakage"
df.loc[(df["Salary"] == 20000),"Salary GorB"] = "Greate Salary Pakage"
df.loc[(df["Salary"] > 20000),"Salary GorB"] = "Greatest Salary Pakage"
print(df)

    EEID     Name    Age  Salary Gender             Salary GorB
0  EMP01   Chetan     21   20000      M    Greate Salary Pakage
1  EMP02   Aakash     20   23000      M  Greatest Salary Pakage
2  EMP03  Darshan     23   20000    NaN    Greate Salary Pakage
3  EMP01   Lokesh     25   15000      M      Good Salary Pakage
4  EMP05     Yash     24   20000    NaN    Greate Salary Pakage
5  EMP06   Sakshi     18   50000      F  Greatest Salary Pakage
6  EMP07   Chetan     21   20000      M    Greate Salary Pakage
7  EMP08   Aakash     21   25000    NaN  Greatest Salary Pakage
8  EMP09   Lokesh     25    5000      M      Good Salary Pakage

In [127]:
count = df[df["Salary GorB"] == "Greate Salary Pakage"].shape[0]
print("Greate Salary Pakage",count)

Greate Salary Pakage 4

In [135]:
df["Salary GorB"].value_counts()["Greatest Salary Pakage"]

3

In [137]:
data = pd.read_excel("C:/Users/Lenovo/OneDrive/Desktop/python data analytics/pratice.xlsx")
print(data)

  First_Name  Last_Name  Salary EEID
0     Chetan       Wagh   20000   E1
1     Aakash  Chaudhari   40000   E2
2    Darshan      Dalvi   25000   E7
3     Lokesh      Bhoge   60000   E8
4       Yash    Mahajan   33000   E4
5     Ganesh      Patil   45000   E5

In [147]:
data["Full Name"] = data["First_Name"].str.capitalize() + " " + data["Last_Name"].str.capitalize()
print(data)

  First_Name  Last_Name  Salary EEID         Full Name
0     Chetan       Wagh   20000   E1       Chetan Wagh
1     Aakash  Chaudhari   40000   E2  Aakash Chaudhari
2    Darshan      Dalvi   25000   E7     Darshan Dalvi
3     Lokesh      Bhoge   60000   E8      Lokesh Bhoge
4       Yash    Mahajan   33000   E4      Yash Mahajan
5     Ganesh      Patil   45000   E5      Ganesh Patil

## columns transforation in pandas part 1

In [150]:
data = pd.read_excel("C:/Users/Lenovo/OneDrive/Desktop/python data analytics/pratice.xlsx")
print(data)

  First_Name  Last_Name  Salary EEID
0     Chetan       Wagh   20000   E1
1     Aakash  Chaudhari   40000   E2
2    Darshan      Dalvi   25000   E7
3     Lokesh      Bhoge   60000   E8
4       Yash    Mahajan   33000   E4
5     Ganesh      Patil   45000   E5

In [152]:
data["Bonus"] = (data["Salary"]/100)*20
print(data)

  First_Name  Last_Name  Salary EEID    Bonus
0     Chetan       Wagh   20000   E1   4000.0
1     Aakash  Chaudhari   40000   E2   8000.0
2    Darshan      Dalvi   25000   E7   5000.0
3     Lokesh      Bhoge   60000   E8  12000.0
4       Yash    Mahajan   33000   E4   6600.0
5     Ganesh      Patil   45000   E5   9000.0

In [7]:
data1 = {'Months': ['January','Feburay','March','April']}
    
a = pd.DataFrame(data1)
print(a)

def extract(value):
    return value[0:3]

a['shorts_monts'] = a["Months"].map(extract)
print(a)

    Months
0  January
1  Feburay
2    March
3    April
    Months shorts_monts
0  January          Jan
1  Feburay          Feb
2    March          Mar
3    April          Apr

In [9]:
data = pd.read_excel("C:/Users/Lenovo/OneDrive/Desktop/python data analytics/sample_data.xlsx")
print(data)

                       Country  Year   Rank  Total  S1: Demographic Pressures  \
0                      Somalia  2023    1st  111.9                       10.0
1                        Yemen  2023    2nd  108.9                        9.6
2                  South Sudan  2023    3rd  108.5                        9.7
3    Congo Democratic Republic  2023    4th  107.2                        9.7
4                        Syria  2023    5th  107.1                        7.4
..                         ...   ...    ...    ...                        ...
174                Switzerland  2023  175th   17.8                        2.4
175                New Zealand  2023  176th   16.7                        1.1
176                    Finland  2023  177th   16.0                        1.7
177                    Iceland  2023  178th   15.7                        1.5
178                     Norway  2023  179th   14.5                        1.4

     S2: Refugees and IDPs  C3: Group Grievance  \
0                      9.0                  8.7
1                      9.6                  8.8
2                     10.0                  8.6
3                      9.8                  9.4
4                      9.1                  9.1
..                     ...                  ...
174                    3.2                  2.1
175                    1.2                  2.0
176                    1.9                  0.3
177                    1.5                  0.5
178                    1.7                  3.1

     E3: Human Flight and Brain Drain  E2: Economic Inequality  E1: Economy  \
0                                 8.6                      9.1          9.5
1                                 6.4                      7.9          9.9
2                                 6.5                      8.6          8.6
3                                 6.4                      8.4          8.1
4                                 8.0                      6.5          9.6
..                                ...                      ...          ...
174                               1.0                      2.4          1.6
175                               1.6                      2.6          2.6
176                               1.5                      1.6          2.7
177                               1.6                      1.5          2.6
178                               0.7                      1.4          1.4

     P1: State Legitimacy  P2: Public Services  P3: Human Rights  \
0                     9.6                  9.8               9.0
1                     9.8                  9.6               9.6
2                     9.8                  9.7               8.7
3                     9.3                  9.3               9.3
4                    10.0                  9.0               9.1
..                    ...                  ...               ...
174                   0.3                  1.6               0.4
175                   0.5                  1.1               0.5
176                   0.4                  1.0               0.5
177                   0.4                  0.9               0.4
178                   0.4                  1.0               0.4

     C1: Security Apparatus  C2: Factionalized Elites  \
0                       9.5                      10.0
1                       8.6                       9.9
2                       9.9                       9.2
3                       8.8                       9.6
4                       9.4                       9.9
..                      ...                       ...
174                     1.4                       1.0
175                     1.6                       1.4
176                     2.0                       1.4
177                     0.4                       1.8
178                     1.4                       1.1

     X1: External Intervention
0                          9.1
1                          9.2
2                          9.2
3                          9.1
4                         10.0
..                         ...
174                        0.4
175                        0.5
176                        1.0
177                        2.6
178                        0.5

[179 rows x 16 columns]

In [19]:
gr = data.groupby(["Country","Year"]).agg({"Rank":"count"})
print(gr)
print(gr.head(10))
print(gr.tail(10))

                          Rank
Country             Year
Afghanistan         2023     1
Albania             2023     1
Algeria             2023     1
Angola              2023     1
Antigua and Barbuda 2023     1
...                        ...
Venezuela           2023     1
Vietnam             2023     1
Yemen               2023     1
Zambia              2023     1
Zimbabwe            2023     1

[179 rows x 1 columns]
                          Rank
Country             Year
Afghanistan         2023     1
Albania             2023     1
Algeria             2023     1
Angola              2023     1
Antigua and Barbuda 2023     1
Argentina           2023     1
Armenia             2023     1
Australia           2023     1
Austria             2023     1
Azerbaijan          2023     1
                           Rank
Country              Year
United Arab Emirates 2023     1
United Kingdom       2023     1
United States        2023     1
Uruguay              2023     1
Uzbekistan           2023     1
Venezuela            2023     1
Vietnam              2023     1
Yemen                2023     1
Zambia               2023     1
Zimbabwe             2023     1

In [23]:
gr1 = data.groupby("Rank").agg({"Year":"count"})
print(gr1)

       Year
Rank
100th     1
101st     1
102nd     1
103rd     1
104th     1
...     ...
96th      1
97th      1
98th      1
99th      1
9th       1

[179 rows x 1 columns]

In [25]:
gr2 = data.groupby("Country").agg({"Total":"mean"})
print(gr2)

print(gr2.head(10))
print(gr2.tail(10))

                     Total
Country
Afghanistan          106.6
Albania               56.8
Algeria               70.0
Angola                86.9
Antigua and Barbuda   53.8
...                    ...
Venezuela             90.5
Vietnam               58.3
Yemen                108.9
Zambia                81.8
Zimbabwe              96.9

[179 rows x 1 columns]
                     Total
Country
Afghanistan          106.6
Albania               56.8
Algeria               70.0
Angola                86.9
Antigua and Barbuda   53.8
Argentina             46.4
Armenia               67.5
Australia             22.0
Austria               24.4
Azerbaijan            72.7
                      Total
Country
United Arab Emirates   37.0
United Kingdom         41.9
United States          45.3
Uruguay                34.4
Uzbekistan             66.8
Venezuela              90.5
Vietnam                58.3
Yemen                 108.9
Zambia                 81.8
Zimbabwe               96.9

In [27]:
gr3 = data.groupby("Country").agg({"Total":"max"})
print(gr3)

                     Total
Country
Afghanistan          106.6
Albania               56.8
Algeria               70.0
Angola                86.9
Antigua and Barbuda   53.8
...                    ...
Venezuela             90.5
Vietnam               58.3
Yemen                108.9
Zambia                81.8
Zimbabwe              96.9

[179 rows x 1 columns]

In [29]:
gr4 = data.groupby("Country").agg({"Total":"min"})
print(gr4)

                     Total
Country
Afghanistan          106.6
Albania               56.8
Algeria               70.0
Angola                86.9
Antigua and Barbuda   53.8
...                    ...
Venezuela             90.5
Vietnam               58.3
Yemen                108.9
Zambia                81.8
Zimbabwe              96.9

[179 rows x 1 columns]

### merge , join , and concatenate

In [32]:
data1 = {"Emp ID":["E01","E02","E03","E04","E05","E06"],
        "Name": ["Chetan","Ram","Sham","Rahul","Lokesh","Yash"],
        "Age":[34,56,23,44,32,35]}

data2 = {"Emp ID":["E01","E07","E03","E08","E05","E06"],
         "Salary":[45000,32000,45000,67000,34000,34000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

  Emp ID    Name  Age
0    E01  Chetan   34
1    E02     Ram   56
2    E03    Sham   23
3    E04   Rahul   44
4    E05  Lokesh   32
5    E06    Yash   35

  Emp ID  Salary
0    E01   45000
1    E07   32000
2    E03   45000
3    E08   67000
4    E05   34000
5    E06   34000

In [40]:
print(pd.merge(df1,df2 , on  =  "Emp ID" ))

  Emp ID    Name  Age  Salary
0    E01  Chetan   34   45000
1    E03    Sham   23   45000
2    E05  Lokesh   32   34000
3    E06    Yash   35   34000

In [42]:
print(pd.merge(left = df1,right = df2, on = "Emp ID", how="right"))

  Emp ID    Name   Age  Salary
0    E01  Chetan  34.0   45000
1    E07     NaN   NaN   32000
2    E03    Sham  23.0   45000
3    E08     NaN   NaN   67000
4    E05  Lokesh  32.0   34000
5    E06    Yash  35.0   34000

In [44]:
 import pandas as pd
data3 = {"Emp ID":["E01","E02","E03","E04","E05","E06"],
        "Name": ["Chetan","Ram","Sham","Rahul","Lokesh","Yash"],
        "Age":[34,56,23,44,32,35]}
data4 = {"Emp ID":["E07","E08","E09","E10","E11","E13"],
        "Name": ["Bunty","Bubble","Golu","Baiya","Pappu","rathod"],
        "Age":[34,54,67,35,23,56]}
df3 = pd.DataFrame(data3)
df4 = pd.DataFrame(data4)

In [46]:
    print(pd.concat([df3,df4]))

  Emp ID    Name  Age
0    E01  Chetan   34
1    E02     Ram   56
2    E03    Sham   23
3    E04   Rahul   44
4    E05  Lokesh   32
5    E06    Yash   35
0    E07   Bunty   34
1    E08  Bubble   54
2    E09    Golu   67
3    E10   Baiya   35
4    E11   Pappu   23
5    E13  rathod   56

### pandas compare dataframe

In [75]:
dict = {"Fruits":["Banana","Mango","Apple","Orange"],
       "Price": [100,150,230,120],
       "Quantity":[15,10,15,7]}
df1 = pd.DataFrame(dict)
df1

   Fruits  Price  Quantity
0  Banana    100        15
1   Mango    150        10
2   Apple    230        15
3  Orange    120         7

In [77]:
df2= df1.copy()
df2

   Fruits  Price  Quantity
0  Banana    100        15
1   Mango    150        10
2   Apple    230        15
3  Orange    120         7

In [79]:
df2.loc[0,"Price"]=120
df2.loc[2,"Price"]=250
df2.loc[3,"Price"]=100
df2.loc[0,"Quantity"]=10
df2.loc[2,"Quantity"]=17
df2.loc[3,"Quantity"]=12
print(df2)
print

   Fruits  Price  Quantity
0  Banana    120        10
1   Mango    150        10
2   Apple    250        17
3  Orange    100        12

In [81]:
print(df2)

   Fruits  Price  Quantity
0  Banana    120        10
1   Mango    150        10
2   Apple    250        17
3  Orange    100        12

In [83]:
print(df1)

   Fruits  Price  Quantity
0  Banana    100        15
1   Mango    150        10
2   Apple    230        15
3  Orange    120         7

In [91]:
print(df1.compare(df2,align_axis = 0))

         Price  Quantity
0 self   100.0      15.0
  other  120.0      10.0
2 self   230.0      15.0
  other  250.0      17.0
3 self   120.0       7.0
  other  100.0      12.0

In [93]:
print(df1.compare(df2,keep_equal=True))

  Price       Quantity
   self other     self other
0   100   120       15    10
2   230   250       15    17
3   120   100        7    12

## pivoting and melting dataframe

In [102]:
dict = {"Keys":["k1","k2","k1","k2"],
       "Name":["David","Peter","john","Ben"],
       "Houses":["red","Blue","green","red"],
       "Grades":["3rd","4th","8th","2nd"]}
df1=pd.DataFrame(dict)
print(df1)

  Keys   Name Houses Grades
0   k1  David    red    3rd
1   k2  Peter   Blue    4th
2   k1   john  green    8th
3   k2    Ben    red    2nd

In [108]:
df1.pivot(index="Keys", columns="Name", values="Houses")

Name  Ben David Peter   john
Keys
k1    NaN   red   NaN  green
k2    red   NaN  Blue    NaN

In [106]:
print(df1.pivot(index="Keys", columns="Name", values=["Houses","Grades"]))

     Houses                    Grades
Name    Ben David Peter   john    Ben David Peter john
Keys
k1      NaN   red   NaN  green    NaN   3rd   NaN  8th
k2      red   NaN  Blue    NaN    2nd   NaN   4th  NaN

In [110]:
dict2 = {"Name":["David","Peter","john","Ben"],
       "Houses":["red","Blue","green","red"],
       "Grades":["3rd","4th","8th","2nd"]}
df2=pd.DataFrame(dict2)
print(df2)

    Name Houses Grades
0  David    red    3rd
1  Peter   Blue    4th
2   john  green    8th
3    Ben    red    2nd

In [120]:
print(pd.melt(df2, id_vars=["Name"],value_vars=["Houses"])) #equal to missing

    Name variable  value
0  David   Houses    red
1  Peter   Houses   Blue
2   john   Houses  green
3    Ben   Houses    red

In [124]:
# value_vars print(pd.melt(df2, id_vars=["Name"],value_vars =["Houses","Grades"],var_name="House and Grades",value_name="Values"))
print(pd.melt(df2, id_vars=["Name"], value_vars=["Houses", "Grades"], 
              var_name="House and Grades", value_name="Values"))

    Name House and Grades Values
0  David           Houses    red
1  Peter           Houses   Blue
2   john           Houses  green
3    Ben           Houses    red
4  David           Grades    3rd
5  Peter           Grades    4th
6   john           Grades    8th
7    Ben           Grades    2nd